Pandas leverages the power and speed of numpy so it is as fast as numpy.
it provides rich & high robust data operations.

In [0]:
import numpy as np
import pandas as pd

In [0]:
dict1 = {
    "name":['harry','rohan','skillf','shubh'],
    "marks":[92,34,24,17],
    "city":['rampur','kolkata','bareilly','antartica']
}

data framing the dict1

In [0]:
df=pd.DataFrame(dict1)

In [4]:
df

     name  marks       city
0   harry     92     rampur
1   rohan     34    kolkata
2  skillf     24   bareilly
3   shubh     17  antartica

df.to_csv('name_of_file.csv') will create the csv file of df

In [0]:
df.to_csv('friends.csv')

"index=false" will delete the index

In [0]:
df.to_csv('friends_indexfalse.csv', index=False)

In [7]:
df.head(2)

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata

In [8]:
df.tail(2)

     name  marks       city
2  skillf     24   bareilly
3   shubh     17  antartica

df.describe() will decsribe about df

In [9]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

to read a csv file

In [0]:
harry = pd.read_csv('abc.csv')

In [11]:
harry

   Unnamed: 0  train no  speed       city
0           0      1541     50     rampur
1           1      4875     34    kolkata
2           2       879     24   bareilly
3           3      9597     17  antartica

to change the value in speed column

In [12]:
harry['speed'][0]=50

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

<<<<<<<<<warning in above cell, the warning had been studied in loc>>>>>>>>>>>>>

In [0]:
harry.to_csv('abc.csv')

In [0]:
harry.index=['first','second','third','fourth']

In [15]:
harry

        Unnamed: 0  train no  speed       city
first            0      1541     50     rampur
second           1      4875     34    kolkata
third            2       879     24   bareilly
fourth           3      9597     17  antartica

**Pandas Data Structutes**
**2 types**:
1. **SERIES**- its a 1-D array with indexes, it stores a single column or row of data in a dataframe.
2. **DATAFRAME**- Its a tabular spreadsheet like structures representing rows each of which contains one or multiple columns.


A 1d array(labeled) capable of holding any type of data- **SERIES**.

A 2d data(labeled) structure with column of potentially different types of data- **DATAFRAME**

__________________________________________________________________________________

pd.Series(np.random.rand(34) will make a series which will be made with the help of numpy, and this Series will have from 0 to 33.

In [0]:
ser=pd.Series(np.random.rand(34))

In [20]:
ser

0     0.473528
1     0.301054
2     0.389335
3     0.363648
4     0.704215
5     0.184995
6     0.168502
7     0.786787
8     0.611604
9     0.975117
10    0.913644
11    0.268010
12    0.475306
13    0.716909
14    0.700662
15    0.428351
16    0.171538
17    0.255920
18    0.653623
19    0.314010
20    0.043116
21    0.827600
22    0.653950
23    0.787601
24    0.432695
25    0.980865
26    0.347823
27    0.686604
28    0.450072
29    0.707836
30    0.091653
31    0.451720
32    0.685442
33    0.050875
dtype: float64

In [21]:
type(ser)

pandas.core.series.Series

In [0]:
newdf = pd.DataFrame(np.random.rand(334,5), index=np.arange(334))

In [25]:
newdf.head(2)

          0         1         2         3         4
0  0.803896  0.037755  0.216857  0.831418  0.524184
1  0.712657  0.408719  0.503885  0.551374  0.168778

In [26]:
type(newdf)

pandas.core.frame.DataFrame

In [27]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.476349    0.493111    0.518301    0.480797    0.487998
std      0.279230    0.292478    0.288224    0.293667    0.289565
min      0.000743    0.004356    0.004108    0.000230    0.004801
25%      0.246904    0.224599    0.270386    0.239055    0.236264
50%      0.459817    0.496724    0.545779    0.452754    0.481372
75%      0.707433    0.749292    0.750177    0.739616    0.721773
max      0.995067    0.996128    0.999518    0.990816    0.998875

it will tell what datatypes i have in what column

In [30]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [0]:
newdf[0][0]='harry'

In [33]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

will give number of index

In [34]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [35]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [36]:
newdf.to_numpy()

array([['harry', 0.037754623415272914, 0.216856745376812,
        0.8314178625941125, 0.5241842814390095],
       [0.7126568442997536, 0.40871922204229816, 0.5038845425528875,
        0.5513740463030693, 0.16877840274795464],
       [0.5902688135516395, 0.21990082724791205, 0.03577770188924523,
        0.13262835873640377, 0.30753404954335317],
       ...,
       [0.16885089747816595, 0.036421913758025615, 0.2063030204504105,
        0.9431087089594471, 0.903737824042374],
       [0.6343374266330603, 0.694115962179845, 0.37577721744743253,
        0.5859946457998462, 0.021510088281611495],
       [0.45147823521935604, 0.2581132536412799, 0.2736028270170151,
        0.11135226229093709, 0.27703460818422343]], dtype=object)

In [38]:
newdf[0][0]='0.2'

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

<<<<<<<<<warning in above cell, the warning had been studied in **loc**>>>>>>>>>>>>>

In [39]:
newdf.to_numpy()

array([['0.2', 0.037754623415272914, 0.216856745376812,
        0.8314178625941125, 0.5241842814390095],
       [0.7126568442997536, 0.40871922204229816, 0.5038845425528875,
        0.5513740463030693, 0.16877840274795464],
       [0.5902688135516395, 0.21990082724791205, 0.03577770188924523,
        0.13262835873640377, 0.30753404954335317],
       ...,
       [0.16885089747816595, 0.036421913758025615, 0.2063030204504105,
        0.9431087089594471, 0.903737824042374],
       [0.6343374266330603, 0.694115962179845, 0.37577721744743253,
        0.5859946457998462, 0.021510088281611495],
       [0.45147823521935604, 0.2581132536412799, 0.2736028270170151,
        0.11135226229093709, 0.27703460818422343]], dtype=object)

Transpose

In [42]:
newdf.T

         0         1          2    ...        331        332       333
0        0.2  0.712657   0.590269  ...   0.168851   0.634337  0.451478
1  0.0377546  0.408719   0.219901  ...  0.0364219   0.694116  0.258113
2   0.216857  0.503885  0.0357777  ...   0.206303   0.375777  0.273603
3   0.831418  0.551374   0.132628  ...   0.943109   0.585995  0.111352
4   0.524184  0.168778   0.307534  ...   0.903738  0.0215101  0.277035

[5 rows x 334 columns]

for sorting of axis=0(rows) in asecnding=false(in descending order)

In [44]:
newdf.sort_index(axis=0, ascending=False)

            0         1         2         3         4
333  0.451478  0.258113  0.273603  0.111352  0.277035
332  0.634337  0.694116  0.375777  0.585995  0.021510
331  0.168851  0.036422  0.206303  0.943109  0.903738
330  0.327396  0.988923  0.753816  0.459164  0.659026
329  0.693268  0.655266  0.925603  0.344342  0.916829
..        ...       ...       ...       ...       ...
4    0.577552  0.280542  0.299609  0.582474  0.486116
3    0.897047  0.736057  0.526577  0.284122  0.897792
2    0.590269  0.219901  0.035778  0.132628  0.307534
1    0.712657  0.408719  0.503885  0.551374  0.168778
0         0.2  0.037755  0.216857  0.831418  0.524184

[334 rows x 5 columns]

In [45]:
newdf.head()

          0         1         2         3         4
0       0.2  0.037755  0.216857  0.831418  0.524184
1  0.712657  0.408719  0.503885  0.551374  0.168778
2  0.590269  0.219901  0.035778  0.132628  0.307534
3  0.897047  0.736057  0.526577  0.284122  0.897792
4  0.577552  0.280542  0.299609  0.582474  0.486116

In [46]:
newdf[0]

0           0.2
1      0.712657
2      0.590269
3      0.897047
4      0.577552
         ...
329    0.693268
330    0.327396
331    0.168851
332    0.634337
333    0.451478
Name: 0, Length: 334, dtype: object

In [47]:
type(newdf[0])

pandas.core.series.Series

newdf will not be copied to newdf2, here newdf2 will be **POINTING** newdf. So any changes in newdf2 will change the value in newdf

In [0]:
newdf2=newdf

In [49]:
newdf2[0][0]=9783

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

<<<<<<<<<warning in above cell, the warning had been studied in **loc**>>>>>>>>>>>>>

In [50]:
newdf

            0         1         2         3         4
0        9783  0.037755  0.216857  0.831418  0.524184
1    0.712657  0.408719  0.503885  0.551374  0.168778
2    0.590269  0.219901  0.035778  0.132628  0.307534
3    0.897047  0.736057  0.526577  0.284122  0.897792
4    0.577552  0.280542  0.299609  0.582474  0.486116
..        ...       ...       ...       ...       ...
329  0.693268  0.655266  0.925603  0.344342  0.916829
330  0.327396  0.988923  0.753816  0.459164  0.659026
331  0.168851  0.036422  0.206303  0.943109  0.903738
332  0.634337  0.694116  0.375777  0.585995  0.021510
333  0.451478  0.258113  0.273603  0.111352  0.277035

[334 rows x 5 columns]

to make *copy*, here we are making copy of newdf to newdf3

In [0]:
newdf3=newdf.copy()

In [54]:
newdf3

            0         1         2         3         4
0        9783  0.037755  0.216857  0.831418  0.524184
1    0.712657  0.408719  0.503885  0.551374  0.168778
2    0.590269  0.219901  0.035778  0.132628  0.307534
3    0.897047  0.736057  0.526577  0.284122  0.897792
4    0.577552  0.280542  0.299609  0.582474  0.486116
..        ...       ...       ...       ...       ...
329  0.693268  0.655266  0.925603  0.344342  0.916829
330  0.327396  0.988923  0.753816  0.459164  0.659026
331  0.168851  0.036422  0.206303  0.943109  0.903738
332  0.634337  0.694116  0.375777  0.585995  0.021510
333  0.451478  0.258113  0.273603  0.111352  0.277035

[334 rows x 5 columns]

# loc
so the warnings we have encountered in above cells when wwe were changing the values in array, so we will use **loc** function to change the value in the array

In [0]:
newdf.loc[0,0] = 654

In [56]:
newdf.head(2)

          0         1         2         3         4
0       654  0.037755  0.216857  0.831418  0.524184
1  0.712657  0.408719  0.503885  0.551374  0.168778

In [0]:
newdf.columns=list("ABCDE")

In [60]:
newdf.head(2)

          A         B         C         D         E
0       654  0.037755  0.216857  0.831418  0.524184
1  0.712657  0.408719  0.503885  0.551374  0.168778

In [0]:
newdf.loc[0,'A']= 677768

In [63]:
newdf.head(2)

          A         B         C         D         E
0    677768  0.037755  0.216857  0.831418  0.524184
1  0.712657  0.408719  0.503885  0.551374  0.168778

drop will remove a column or row based on indexing.

In [67]:
newdf.drop(0, axis=0)

            A         B         C         D         E
1    0.712657  0.408719  0.503885  0.551374  0.168778
2    0.590269  0.219901  0.035778  0.132628  0.307534
3    0.897047  0.736057  0.526577  0.284122  0.897792
4    0.577552  0.280542  0.299609  0.582474  0.486116
5    0.367013  0.124402  0.086717  0.263900  0.246594
..        ...       ...       ...       ...       ...
329  0.693268  0.655266  0.925603  0.344342  0.916829
330  0.327396  0.988923  0.753816  0.459164  0.659026
331  0.168851  0.036422  0.206303  0.943109  0.903738
332  0.634337  0.694116  0.375777  0.585995  0.021510
333  0.451478  0.258113  0.273603  0.111352  0.277035

[333 rows x 5 columns]

to get data under a range

In [74]:
newdf.loc[[1,2],['C','D']]

          C         D
1  0.503885  0.551374
2  0.035778  0.132628

In [78]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.1)]

             A         B         C         D         E
8    0.0974926  0.331673  0.585584  0.486300  0.730895
9     0.255862  0.317826  0.825970  0.429272  0.493029
10    0.104914  0.115297  0.356209  0.650954  0.992034
14    0.127973  0.493188  0.392952  0.026381  0.899203
15    0.018846  0.845132  0.302895  0.800433  0.563168
..         ...       ...       ...       ...       ...
304   0.134718  0.262914  0.995298  0.485203  0.396636
305   0.145598  0.085156  0.974584  0.340146  0.580385
310   0.081317  0.523377  0.649640  0.352587  0.416567
314  0.0987843  0.776734  0.224760  0.961773  0.369623
331   0.168851  0.036422  0.206303  0.943109  0.903738

[95 rows x 5 columns]

In [79]:
newdf.head(2)

          A         B         C         D         E
0    677768  0.037755  0.216857  0.831418  0.524184
1  0.712657  0.408719  0.503885  0.551374  0.168778

# iloc
it will count from 0-4 to then it will give the value, whereas in loc we have to give the same name of the index.

In [80]:
newdf.iloc[0,4]

0.5241842814390095

In [81]:
newdf.iloc[[0,1],[1,2]]

          B         C
0  0.037755  0.216857
1  0.408719  0.503885

In [83]:
newdf.head(3)

          A         B         C         D         E
0    677768  0.037755  0.216857  0.831418  0.524184
1  0.712657  0.408719  0.503885  0.551374  0.168778
2  0.590269  0.219901  0.035778  0.132628  0.307534

will drop row 1,5 inplace=True mean it will modify the newdf.

In [0]:
newdf.drop([1,5],axis=0, inplace=True)

In [90]:
newdf

            B         D         E
0    0.037755  0.831418  0.524184
2    0.219901  0.132628  0.307534
3    0.736057  0.284122  0.897792
4    0.280542  0.582474  0.486116
6    0.537036  0.300082  0.055523
..        ...       ...       ...
329  0.655266  0.344342  0.916829
330  0.988923  0.459164  0.659026
331  0.036422  0.943109  0.903738
332  0.694116  0.585995  0.021510
333  0.258113  0.111352  0.277035

[332 rows x 3 columns]

to reset index, but it will add one more column of index

In [91]:
newdf.reset_index()

     index         B         D         E
0        0  0.037755  0.831418  0.524184
1        2  0.219901  0.132628  0.307534
2        3  0.736057  0.284122  0.897792
3        4  0.280542  0.582474  0.486116
4        6  0.537036  0.300082  0.055523
..     ...       ...       ...       ...
327    329  0.655266  0.344342  0.916829
328    330  0.988923  0.459164  0.659026
329    331  0.036422  0.943109  0.903738
330    332  0.694116  0.585995  0.021510
331    333  0.258113  0.111352  0.277035

[332 rows x 4 columns]

drop=true will remove the index column, see above output.

In [0]:
newdf.reset_index(drop=True, inplace=True)

In [94]:
newdf

            B         D         E
0    0.037755  0.831418  0.524184
1    0.219901  0.132628  0.307534
2    0.736057  0.284122  0.897792
3    0.280542  0.582474  0.486116
4    0.537036  0.300082  0.055523
..        ...       ...       ...
327  0.655266  0.344342  0.916829
328  0.988923  0.459164  0.659026
329  0.036422  0.943109  0.903738
330  0.694116  0.585995  0.021510
331  0.258113  0.111352  0.277035

[332 rows x 3 columns]

dropna() will remove every null elements

In [95]:
newdf.dropna()

            B         D         E
0    0.037755  0.831418  0.524184
1    0.219901  0.132628  0.307534
2    0.736057  0.284122  0.897792
3    0.280542  0.582474  0.486116
4    0.537036  0.300082  0.055523
..        ...       ...       ...
327  0.655266  0.344342  0.916829
328  0.988923  0.459164  0.659026
329  0.036422  0.943109  0.903738
330  0.694116  0.585995  0.021510
331  0.258113  0.111352  0.277035

[332 rows x 3 columns]

isnull() will give true if any element is null is B column, else it will give false

In [96]:
newdf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
327    False
328    False
329    False
330    False
331    False
Name: B, Length: 332, dtype: bool

will make all value none at 'B' column

In [0]:
newdf.loc['B']=None

In [99]:
newdf

        B         D         E
0    None  0.831418  0.524184
1    None  0.132628  0.307534
2    None  0.284122  0.897792
3    None  0.582474  0.486116
4    None  0.300082  0.055523
..    ...       ...       ...
328  None  0.459164  0.659026
329  None  0.943109  0.903738
330  None  0.585995  0.021510
331  None  0.111352  0.277035
B    None       NaN       NaN

[333 rows x 3 columns]

In [0]:
newdf.loc[:,['B']]=None

In [101]:
newdf

        B         D         E
0    None  0.831418  0.524184
1    None  0.132628  0.307534
2    None  0.284122  0.897792
3    None  0.582474  0.486116
4    None  0.300082  0.055523
..    ...       ...       ...
328  None  0.459164  0.659026
329  None  0.943109  0.903738
330  None  0.585995  0.021510
331  None  0.111352  0.277035
B    None       NaN       NaN

[333 rows x 3 columns]

In [102]:
newdf['B'].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
328    True
329    True
330    True
331    True
B      True
Name: B, Length: 333, dtype: bool

In [0]:
newdf.loc[:,['B']]=34

In [105]:
newdf.head()

    B         D         E
0  34  0.831418  0.524184
1  34  0.132628  0.307534
2  34  0.284122  0.897792
3  34  0.582474  0.486116
4  34  0.300082  0.055523

In [0]:
df=df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [107]:
df.head()

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [109]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25

dropna will remove null only if all the elements in column are null.

In [110]:
df.dropna(how='all')

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [0]:
df1=pd.DataFrame({"name": ['Alfred', 'Batman', 'Alfred'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [114]:
df1.drop_duplicates()

     name        toy       born
0  Alfred        NaN        NaT
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

as drop_duplicates doesnot take **axis** as an argument so we have to use **subset** here.
keep will let you choose which duplicate you want to keep

In [117]:
df1.drop_duplicates(subset=['name'],keep='last')

     name        toy       born
1  Batman  Batmobile 1940-04-25
2  Alfred   Bullwhip        NaT

In [118]:
df.shape

(3, 3)

information about df

In [120]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 200.0+ bytes

In [125]:
df1['toy'].value_counts(dropna=True)

Bullwhip     1
Batmobile    1
Name: toy, dtype: int64

true on not null values and vice-versa

In [126]:
df.notnull()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False

# Question
create a dataframe which contains only integers with 3 rows and columns

run following methods:
df.describe()
df.mean()
df.corr()
df.count()
df.max()
df.min()
df.median()
df.std()

In [0]:
#data=pd.read_excel('name.xlxs', sheet_name='sheet1')
#to read sheets